In [2]:
import numpy as np
import pandas as pd
from pandas import  DataFrame, Series

In [8]:
data= Series(['one','two',np.nan,'four'])
data

0     one
1     two
2     NaN
3    four
dtype: object

In [9]:
data.isnull()# finding  out null

0    False
1    False
2     True
3    False
dtype: bool

In [10]:
data.dropna() # dropping null

0     one
1     two
3    four
dtype: object

In [12]:
dframe =DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [19]:
clean_dframe= dframe.dropna()
clean_dframe
#dropping  null in data Frame

     0    1    2
0  1.0  2.0  3.0

In [20]:
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [15]:
dframe.dropna(how='all') #this drops only those having nul;l in both rows and columns

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [44]:
dframe.dropna(axis=0)

     0    1    2
0  1.0  2.0  3.0

In [ ]:
# We can thrushhold missing data

In [25]:
nan = np.nan

dframe2  =  DataFrame([[1,2,3,nan],[2,nan,5,6],[nan,7,nan,9],[1,nan,nan,nan]])
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [27]:
dframe2.dropna(thresh = 2)

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [28]:
dframe2.dropna(thresh = 3)

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0

In [ ]:
#  how to fill NA

In [30]:
dframe2.fillna(1) # this replace all na with 1

     0    1    2    3
0  1.0  2.0  3.0  1.0
1  2.0  1.0  5.0  6.0
2  1.0  7.0  1.0  9.0
3  1.0  1.0  1.0  1.0

In [31]:
#  how to  fill differnent  Na colulmn with differnet  values

In [32]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [33]:
dframe2.fillna({0:1,1:3,2:4,3:7})# Passing a dictionary

     0    1    2    3
0  1.0  2.0  3.0  7.0
1  2.0  3.0  5.0  6.0
2  1.0  7.0  4.0  9.0
3  1.0  3.0  4.0  7.0

In [ ]:
# if we  want to  modify  existing  objject

In [40]:
dframe3 =DataFrame([[1,2,3,nan],[2,nan,5,6],[nan,7,nan,9],[1,nan,nan,nan]])
dframe3

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [42]:
dframe3.fillna(0,inplace =True)  # this  argument will  permanently  impact orginal  dataframe
dframe3

     0    1    2    3
0  1.0  2.0  3.0  0.0
1  2.0  0.0  5.0  6.0
2  0.0  7.0  0.0  9.0
3  1.0  0.0  0.0  0.0